{
  "backend/main.mo": "Main Motoko actor defining Product, Order, ContactSubmission, and BlogPost types with CRUD operations, query methods, coupon code application, and migration support.",
  "backend/migration.mo": "Migration module that converts a legacy flat array of Products into a Map-based structure for the updated actor state.",
  "feature_evidence.json": "Feature evidence report mapping implemented frontend/backend features to their source files, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary of short descriptions for each frontend source file, summarizing purpose and notable fixes for each component, page, hook, and style file.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, wraps the layout in Cart and Wishlist context providers, and initializes sample backend content on load.",
  "frontend/src/components/BestSellers.tsx": "Home page section displaying the top 4 products fetched via React Query, with loading skeletons and a link to the full shop.",
  "frontend/src/components/BlogPostCard.tsx": "Card component for a blog post showing a cover image, category badge, title, excerpt, author, and formatted date with a link to the full post page.",
  "frontend/src/components/CategoryFilter.tsx": "Filter chip bar rendering category buttons with active/inactive styling, allowing users to select a product category.",
  "frontend/src/components/FeaturedCategories.tsx": "Renders a grid of home decor category cards (Living Room, Bedroom, Kitchen, etc.) with images and links to the shop page filtered by category.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, social media links, quick navigation links, and contact details including address, phone, and email.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop/mobile navigation, cart item count badge, wishlist link, and admin dashboard icon.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a background image, headline, CTA buttons linking to shop and about pages, and a highlights bar showing key selling points.",
  "frontend/src/components/InstagramGallery.tsx": "Displays a 6-tile Instagram-style photo grid with hover overlay effects, each tile linking to the Instagram profile.",
  "frontend/src/components/ProductCard.tsx": "Product card component showing image, category badge, name, description, price, and hover-revealed add-to-cart and wishlist buttons with a link to the product detail page.",
  "frontend/src/components/ProductCatalog.tsx": "Product listing section that fetches products by category, renders a category filter, skeleton loaders, error/empty states, and a responsive grid of ProductCard components.",
  "frontend/src/components/ShippingReturnAccordion.tsx": "Renders an accordion component with three sections: Shipping Information, Return Policy, and Care Instructions, each containing static bullet-point details.",
  "frontend/src/components/Testimonials.tsx": "Displays a static testimonials section with three customer reviews including star ratings, quotes, and author info in a dark-themed grid layout.",
  "frontend/src/components/WhatsAppButton.tsx": "Renders a fixed floating WhatsApp chat button that opens a pre-filled WhatsApp message to a hardcoded phone number.",
  "frontend/src/contexts/CartContext.tsx": "Provides a React context for cart state management with add, remove, update, and clear operations, persisting cart items to localStorage with BigInt serialization support.",
  "frontend/src/contexts/WishlistContext.tsx": "Provides a React context for wishlist state management with add, remove, and move-to-cart operations, persisting wishlist items to localStorage with BigInt serialization support.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both authenticated and anonymous identities, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via a React context and hook, managing AuthClient creation, login/logout flow, and identity persistence across page reloads.",
  "frontend/src/hooks/useMutations.ts": "Exports React Query mutation hooks for backend write operations including placing orders, applying coupons, submitting contacts, adding products/blog posts, and initializing sample content.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching products (with optional category filter), orders, contact submissions, and blog posts from the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Playfair Display, Lato), sets up Tailwind directives, and defines a luxury design system with CSS custom properties for light/dark themes including ivory, champagne gold, and matte black palettes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/About.tsx": "About page component displaying the brand story, vision/mission, and team sections with a hero image, styled using the luxury design system.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with tabbed navigation for overview, products, orders, contacts, and blog management, including forms to add products and blog posts via mutation hooks.",
  "frontend/src/pages/Blog.tsx": "Blog listing page that fetches and displays blog post cards in a grid, with loading skeletons, error state, and an empty state using the useBlogPosts query hook.",
  "frontend/src/pages/BlogPost.tsx": "Individual blog post detail page that looks up a post by ID from the blog posts query, renders a hero image, metadata, excerpt, and parses basic markdown-style headings in the body.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that displays cart items with quantity controls and removal, shows a subtotal, and links to checkout; renders an empty state when the cart has no items.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects guest name, email, and shipping address, supports coupon code application, and places an order via mutations, showing a success confirmation screen upon completion.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated form (name, email, subject, message) that submits via a mutation and displays a success state, alongside static contact info (address, phone, email).",
  "frontend/src/pages/Home.tsx": "Home page that composes the Hero, FeaturedCategories, BestSellers, Testimonials, and InstagramGallery section components.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that fetches a product by ID, displays its image, details, quantity selector, add-to-cart/wishlist actions, a shipping accordion, and related products.",
  "frontend/src/pages/Shop.tsx": "Shop page that lists products with category filtering, text search, price range filtering, and sort order controls, rendering skeleton loaders while data is fetched.",
  "frontend/src/pages/Wishlist.tsx": "Wishlist page that displays saved products in a grid, allowing users to remove items or move them to the cart, with an empty-state prompt to browse products.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the luxury e-commerce frontend, defining custom fonts (Lato, Playfair Display), OKLCH-based color tokens (ivory, beige, gold, matte-black, sidebar, chart), border radii, box shadows, and keyframe animations for accordion and fade effects.",
  "project_state.json": "Project state manifest (version 7) describing the 'Signature Home Decor LLP' luxury e-commerce site's architecture, feature list, known issues, color palette, category structure, and build history for planning and continuity purposes."
}